#Generated by Fabric Compiler ( version 2021.4-SP1.2 <build 96435> ) at Tue Jun 28 17:10:40 2022

add_design J:/pds/ip_2port_ram/prj/ipcore/ram_2port/ram_2port.idf
add_design J:/pds/ip_2port_ram/prj/ipcore/ram_2port/ram_2port.idf
add_design J:/pds/ip_2port_ram/prj/ipcore/pll_clk/pll_clk.idf
add_design "J:/pds/ip_2port_ram/rtl/ram_wr.v"
add_design "J:/pds/ip_2port_ram/rtl/ram_rd.v"
add_design "J:/pds/ip_2port_ram/rtl/ip_2port_ram.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
add_constraint "J:/pds/ip_2port_ram/prj/ip_2port_ram.fdc"
add_simulation "J:/pds/ip_2port_ram/sim/tb/ip_2port_ram_tb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "J:/pds/ip_2port_ram/prj/synthesize/ip_2port_ram_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_simulation "C:/Users/ch/Desktop/2022.1/ip_2port_ram/sim/tb/ip_2port_ram_tb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic -force"C:/Users/ch/Desktop/2022.1/ip_2port_ram/prj/synthesize/ip_2port_ram_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "C:/Users/ch/Desktop/2022.1/ip_2port_ram/prj/synthesize/ip_2port_ram_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "C:/Users/ch/Desktop/2022.1/ip_2port_ram/sim/tb/ip_2port_ram_tb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_2port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
