#Generated by Fabric Compiler ( version 2021.4-SP1.2 <build 96435> ) at Wed Jun 22 20:23:20 2022

add_design "J:/pds/ip_1port_ram/par/ip_1port_ram.v"
add_design "J:/pds/ip_1port_ram/par/ram_rw.v"
add_design J:/pds/ip_1port_ram/par/ipcore/ram_1port/ram_1port.idf
add_design "J:/pds/ip_1port_ram/prj/source/rtl/ip_1port_ram.v"
add_design "J:/pds/ip_1port_ram/prj/source/rtl/ram_rw.v"
remove_design -force -verilog "J:/pds/ip_1port_ram/prj/ip_1port_ram.v"
remove_design -force -verilog "J:/pds/ip_1port_ram/prj/ram_rw.v"
add_design J:/pds/ip_1port_ram/prj/ipcore/ram_1port/ram_1port.idf
add_design "J:/pds/ip_1port_ram/rtl/ip_1port_ram.v"
remove_design -force -verilog "J:/pds/ip_1port_ram/prj/source/rtl/ip_1port_ram.v"
remove_design -force -verilog "J:/pds/ip_1port_ram/prj/source/rtl/ram_rw.v"
add_design "J:/pds/ip_1port_ram/sim/ram_rw.v"
remove_design -force J:/pds/ip_1port_ram/prj/ipcore/ram_1port/ram_1port.idf
add_design J:/pds/ip_1port_ram/prj/ipcore/ram_1port/ram_1port.idf
remove_design -force J:/pds/ip_1port_ram/prj/ipcore/ram_1port/ram_1port.idf
add_design J:/pds/ip_1port_ram/prj/ipcore/ram_1port/ram_1port.idf
remove_design -force -verilog "J:/pds/ip_1port_ram/sim/ram_rw.v"
add_design "J:/pds/ip_1port_ram/rtl/ram_rw.v"
add_design J:/pds/ip_1port_ram/prj/ipcore/ram_1port/ram_1port.idf
remove_design -force J:/pds/ip_1port_ram/prj/ipcore/ram_1port/ram_1port.idf
add_design J:/pds/ip_1port_ram/prj/ipcore/ram_1port/ram_1port.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
add_constraint "J:/pds/ip_1port_ram/prj/ip_1port_ram.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "J:/pds/ip_1port_ram/sim/ip_1port_ram_tb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force J:/pds/ip_1port_ram/prj/ipcore/ram_1port/ram_1port.idf
add_design J:/pds/ip_1port_ram/prj/ipcore/ram_1port/ram_1port.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force -verilog "J:/pds/ip_1port_ram/rtl/ram_rw.v"
remove_design -force -verilog "J:/pds/ip_1port_ram/rtl/ip_1port_ram.v"
add_design "J:/pds/ip_1port_ram/rtl/ip_1port_ram.v"
add_design "J:/pds/ip_1port_ram/rtl/ram_rw.v"
add_simulation "J:/pds/ip_1port_ram/sim/tb/ip_iport_ram_tb.v"
remove_simulation -force "J:/pds/ip_1port_ram/sim/ip_1port_ram_tb.v"
remove_simulation "J:/pds/ip_1port_ram/sim/tb/ip_iport_ram_tb.v"
add_simulation "J:/pds/ip_1port_ram/sim/tb/ip_1port_ram_tb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_simulation -force "J:/pds/ip_1port_ram/sim/tb/ip_1port_ram_tb.v"
add_simulation "J:/pds/ip_1port_ram/sim/ip_1port_ram_tb.v"
remove_simulation -force "J:/pds/ip_1port_ram/sim/tb/ip_1port_ram_tb.v"
add_simulation "J:/pds/ip_1port_ram/prj/source/ip_1port_ram_tb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "J:/pds/ip_1port_ram/prj/source/tb/ip_1port_ram_tb.v"
remove_simulation "J:/pds/ip_1port_ram/prj/source/ip_1port_ram_tb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_simulation -force "J:/pds/ip_1port_ram/prj/source/tb/ip_1port_ram_tb.v"
add_simulation "J:/pds/ip_1port_ram/sim/tb/ip_1port_ram_tb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "J:/pds/ip_1port_ram/prj/ip_1port_ram.lcf"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint -force -logic -lcf "J:/pds/ip_1port_ram/prj/ip_1port_ram.lcf"
remove_constraint -force -logic -lcf "J:/pds/ip_1port_ram/prj/ip_1port_ram.lcf"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "J:/pds/ip_1port_ram/prj/synthesize/ip_1port_ram_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -dir {E:/PDS_2022.1/Pango/PDS_2022.1/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -dir {E:/PDS_2022.1/Pango/PDS_2022.1/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic -force"C:/Users/ch/Desktop/2022.1/ip_1port_ram/prj/synthesize/ip_1port_ram_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "C:/Users/ch/Desktop/2022.1/ip_1port_ram/prj/synthesize/ip_1port_ram_syn.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -dir {E:/PDS_2022.1/Pango/PDS_2022.1/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -dir {E:/PDS_2022.1/Pango/PDS_2022.1/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_simulation "C:/Users/ch/Desktop/2022.1/ip_1port_ram/sim/tb/ip_1port_ram_tb.v"
add_simulation "C:/Users/ch/Desktop/2022.1/ip_1port_ram/sim/tb/ip_1port_ram_tb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -dir {E:/PDS_2022.1/Pango/PDS_2022.1/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -dir {E:/PDS_2022.1/Pango/PDS_2022.1/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_1port_ram
synthesize -dir {E:/PDS_2022.1/Pango/PDS_2022.1/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
