#Generated by Fabric Compiler ( version 2021.4-SP1.2 <build 96435> ) at Thu Jun 30 11:40:10 2022

add_design J:/pds/ip_fifo/prj/ipcore/fifo_generator_0/fifo_generator_0.idf
add_design J:/pds/ip_fifo/prj/ipcore/fifo_generator_0/fifo_generator_0.idf
add_design "J:/pds/ip_fifo/rtl/ip_fifo.v"
add_design "J:/pds/ip_fifo/rtl/fifo_rd.v"
add_design "J:/pds/ip_fifo/rtl/fifo_wr.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "J:/pds/ip_fifo/prj/ip_fifo.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "J:/pds/ip_fifo/sim/tb/tb_ip_fifo.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_fifo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
