#Generated by Fabric Compiler ( version 2021.4-SP1.2 <build 96435> ) at Wed Jun 22 13:51:48 2022

add_design "J:/pds/ip_pll/rtl/ip_pll.v"
add_design J:/pds/ip_pll/prj/ipcore/pll_clk/pll_clk.idf
add_simulation "J:/pds/ip_pll/sim/tb_ip_pll.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "J:/pds/ip_pll/prj/source/tb/tb_ip_pll.v"
remove_simulation -force "J:/pds/ip_pll/sim/tb_ip_pll.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "J:/pds/ip_pll/prj/source/tb/vtf_ip_pll.v"
remove_simulation -force "J:/pds/ip_pll/prj/source/tb/tb_ip_pll.v"
add_simulation "J:/pds/ip_pll/prj/source/tb/vtf_ip_pll.v"
remove_simulation -force "J:/pds/ip_pll/prj/source/tb/tb_ip_pll.v"
add_simulation "J:/pds/ip_pll/prj/source/sim/tb/vtf_ip_pll.v"
remove_simulation -force "J:/pds/ip_pll/prj/source/tb/vtf_ip_pll.v"
remove_simulation -force "J:/pds/ip_pll/prj/source/sim/tb/vtf_ip_pll.v"
add_simulation "J:/pds/ip_pll/sim/tb/vtf_ip_pll.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "J:/pds/ip_pll/prj/ip_pll.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "C:/Users/ch/Desktop/2022.1/ip_pll/sim/tb/tb_ip_pll.v"
remove_simulation "C:/Users/ch/Desktop/2022.1/ip_pll/sim/tb/vtf_ip_pll.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ip_pll
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
